app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "first_name", "last_name", "phone_number", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.save

UPDATE "users" SET "password_digest" = ?, "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$sfdkQowI/9G5moMydlg1Seo4oWrKRS79NyiW5oeSVICIPDulbrffi"], ["first_name", "newname"], ["last_name", "newname"], ["updated_at", 2017-02-08 03:06:20 UTC], ["id", 1]]
---
    def update
      get_user

      redirect_not_admin_or_self
      if is_an_admin
        @user.update(user_role_param)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def destroy
      if is_an_admin
        get_user
        unless @user.destroy